---
type: SelectionFilterElement
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# SelectionFilterElement

`Autodesk.Revit.DB.SelectionFilterElement` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSet | 2013 | `public void AddSet ( ICollection < ElementId > ids )` |
| Method | AddSingle | 2013 | `public void AddSingle ( ElementId id )` |
| Method | Clear | 2013 | `public void Clear ()` |
| Method | Contains | 2013 | `public bool Contains ( ElementId id )` |
| Method | Create | 2013 | `public static SelectionFilterElement Create ( Document document , string name )` |
| Method | GetElementIds | 2013 | `public ICollection < ElementId > GetElementIds ()` |
| Method | IsEmpty | 2013 | `public bool IsEmpty ()` |
| Method | RemoveSet | 2013 | `public int RemoveSet ( ICollection < ElementId > ids )` |
| Method | RemoveSingle | 2013 | `public void RemoveSingle ( ElementId id )` |
| Method | SetElementIds | 2013 | `public void SetElementIds ( ICollection < ElementId > ids )` |
| Property | Parameter | — | `` |